class DataSource {
    val district = listOf(
        "Московская обл.",
        "Красноярский край",
        "Краснодарский край",
        "Владимирская обл.",
        "Тверская обл.",
        "Мурманская обл.",
        "Самарская обл.",
        "Челябинская обл.",
        "Приморский край",
        "Хабаровский край",
        "Новосибирская обл.",
        "Омская обл.",
        "Иркутская обл."
    )
    val city = listOf(
        "Пенза",
        "Краснодар",
        "Красноярск",
        "Барнаул",
        "Владивосток",
        "Хабаровск",
        "Иркутск",
        "Мурманск",
        "Омск",
        "Новосибирск",
        "Самара",
        "Томск",
        "Челябинск"
    )
    val street = listOf(
        "Карла Маркса",
        "Мира",
        "Ленина",
        "Пушкина",
        "Кутузова",
        "Кирова",
        "Южная",
        "Горького",
        "Парковая",
        "Дружбы",
        "Победы",
        "Калинина",
        "Озерная"
    )

    val maleName = listOf(
        "Иван",
        "Петр",
        "Николай",
        "Сергей",
        "Максим",
        "Денис",
        "Валерий",
        "Евгений",
        "Андрей",
        "Александр",
        "Виктор",
        "Михаил",
        "Марк"
    )
    val femaleName = listOf(
        "Ирина",
        "Анастасия",
        "Татьяна",
        "Виктория",
        "Екатерина",
        "Ольга",
        "Регина",
        "Вероника",
        "Мария",
        "Любовь",
        "Диана",
        "Зоя",
        "Владислава"
    )

    val maleLastname = listOf(
        "Ковалев",
        "Петров",
        "Сидоров",
        "Авдеев",
        "Грачев",
        "Горяев",
        "Гусев",
        "Жуков",
        "Захаров",
        "Зимин",
        "Казаков",
        "Игнатов",
        "Исаев",
        "Зубков"
    )
    val femaleLastname = listOf(
        "Вавилина",
        "Гордеева",
        "Макарова",
        "Александрова",
        "Кузнецова",
        "Соколова",
        "Морозова",
        "Лебедева",
        "Егорова",
        "Семенова",
        "Павлова",
        "Уткина",
        "Круглова",
        "Рожкова",
        "Ватрушкина"
    )

    val malePatronymic = listOf(
        "Андреевич",
        "Петрович",
        "Иванович",
        "Алексеевич",
        "Степанович",
        "Егорович",
        "Сергеевич",
        "Юрьевич",
        "Миронович",
        "Львович",
        "Романович",
        "Платонович",
        "Денисович"
    )
    val femalePatronymic = listOf(
        "Максимовна",
        "Денисовна",
        "Валерьевна",
        "Игоревна",
        "Семеновна",
        "Тимофеевна",
        "Константиновна",
        "Васильевна",
        "Давидовна",
        "Григорьевна",
        "Богдановна",
        "Адамовна",
        "Арсеньевна"
    )

}